### Terraform `plan` Succeeded for Workspace: `default`
<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!   update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.lambda_function.aws_cloudwatch_log_group.lambda[0] will be updated in-place
!   resource "aws_cloudwatch_log_group" "lambda" {
        id                = "/aws/lambda/cataprato-auth-lambda"
        name              = "/aws/lambda/cataprato-auth-lambda"
!       tags              = {
+           "Deployment" = "terraform"
        }
!       tags_all          = {
+           "Deployment" = "terraform"
        }
        # (3 unchanged attributes hidden)
    }

  # module.lambda_function.aws_iam_policy.logs[0] will be updated in-place
!   resource "aws_iam_policy" "logs" {
        id        = "arn:aws:iam::350131064538:policy/tf-managed/cataprato-auth-lambda-logs"
        name      = "cataprato-auth-lambda-logs"
!       tags      = {
+           "Deployment" = "terraform"
        }
!       tags_all  = {
+           "Deployment" = "terraform"
        }
        # (4 unchanged attributes hidden)
    }

  # module.lambda_function.aws_iam_role.lambda[0] will be updated in-place
!   resource "aws_iam_role" "lambda" {
        id                    = "cataprato-auth-lambda"
        name                  = "cataprato-auth-lambda"
!       tags                  = {
+           "Deployment" = "terraform"
        }
!       tags_all              = {
+           "Deployment" = "terraform"
        }
        # (8 unchanged attributes hidden)
    }

  # module.lambda_function.aws_lambda_function.this[0] will be updated in-place
!   resource "aws_lambda_function" "this" {
        id                             = "cataprato-auth-lambda"
!       layers                         = [
-           "arn:aws:lambda:us-east-1:350131064538:layer:cataprato-auth-layer-s3:20",
        ] -> (known after apply)
!       qualified_arn                  = "arn:aws:lambda:us-east-1:350131064538:function:cataprato-auth-lambda:16" -> (known after apply)
!       qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:350131064538:function:cataprato-auth-lambda:16/invocations" -> (known after apply)
!       role                           = "arn:aws:iam::350131064538:role/service-role/cataprato-role-0cqzd0zs" -> "arn:aws:iam::350131064538:role/tf-managed/cataprato-auth-lambda"
!       tags                           = {
+           "Deployment" = "terraform"
        }
!       tags_all                       = {
+           "Deployment" = "terraform"
        }
!       version                        = "16" -> (known after apply)
        # (19 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.lambda_function.aws_lambda_permission.current_version_triggers["APIGatewayAny"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
!       id                  = "APIGatewayAny" -> (known after apply)
!       qualifier           = "16" -> (known after apply)
!       source_arn          = "arn:aws:execute-api:us-east-1:350131064538:aqnku8akd0/*/*/*" -> "arn:aws:execute-api:us-east-1:350131064538:syvh7hov93/*/*"
+       statement_id_prefix = (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.lambda_function.aws_lambda_permission.unqualified_alias_triggers["APIGatewayAny"] must be replaced
-/+ resource "aws_lambda_permission" "unqualified_alias_triggers" {
!       id                  = "APIGatewayAny" -> (known after apply)
!       source_arn          = "arn:aws:execute-api:us-east-1:350131064538:aqnku8akd0/*/*/*" -> "arn:aws:execute-api:us-east-1:350131064538:syvh7hov93/*/*"
+       statement_id_prefix = (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.lambda_function.aws_s3_object.lambda_package[0] will be updated in-place
!   resource "aws_s3_object" "lambda_package" {
        id                     = "lambda-builds/e411b3747d7c97d575ff4a4b958a379045286ab859f4a97534c1323bda97bf9e.zip"
!       tags                   = {
+           "Deployment" = "terraform"
        }
!       tags_all               = {
+           "Deployment" = "terraform"
        }
        # (12 unchanged attributes hidden)
    }

  # module.lambda_function.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
!       id       = "5088002772839080364" -> (known after apply)
!       triggers = {
!           "timestamp" = "1691589140220861000" -> "1691816170828536000"
            # (1 unchanged element hidden)
        }
    }

  # module.lambda_layer_s3.aws_lambda_layer_version.this[0] must be replaced
-/+ resource "aws_lambda_layer_version" "this" {
!       arn                         = "arn:aws:lambda:us-east-1:350131064538:layer:cataprato-auth-layer-s3:20" -> (known after apply)
-       compatible_architectures    = [] -> null
!       created_date                = "2023-08-09T13:53:21.640+0000" -> (known after apply)
!       id                          = "arn:aws:lambda:us-east-1:350131064538:layer:cataprato-auth-layer-s3:20" -> (known after apply)
!       layer_arn                   = "arn:aws:lambda:us-east-1:350131064538:layer:cataprato-auth-layer-s3" -> (known after apply)
!       s3_key                      = "builds/e405213c84ee1b05f0526ef3186ac368accb3b50328be4d2dacaf7843780053f.zip" -> "builds/d41c1c9ec2cf4002f3862575113d3385e77a6ac8d4475fe5e124704cb1ee7b7d.zip"
!       s3_object_version           = "gY3zXc4wj71Y.HZgbdf85SMn7lG4dfmr" -> (known after apply)
+       signing_job_arn             = (known after apply)
+       signing_profile_version_arn = (known after apply)
!       source_code_hash            = "sOaZPb0Bq3qhfZZeq+1XE9x+MTj/YMEly4tn5NnW/Os=" -> (known after apply)
!       source_code_size            = 26186734 -> (known after apply)
!       version                     = "20" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.lambda_layer_s3.aws_s3_object.lambda_package[0] must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
!       bucket_key_enabled     = false -> (known after apply)
!       content_type           = "binary/octet-stream" -> (known after apply)
!       etag                   = "e7dff6ad9230c31638fac70d298679fe-5" -> (known after apply)
!       id                     = "builds/e405213c84ee1b05f0526ef3186ac368accb3b50328be4d2dacaf7843780053f.zip" -> (known after apply)
!       key                    = "builds/e405213c84ee1b05f0526ef3186ac368accb3b50328be4d2dacaf7843780053f.zip" -> "builds/d41c1c9ec2cf4002f3862575113d3385e77a6ac8d4475fe5e124704cb1ee7b7d.zip"
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
!       server_side_encryption = "AES256" -> (known after apply)
!       source                 = "builds/e405213c84ee1b05f0526ef3186ac368accb3b50328be4d2dacaf7843780053f.zip" -> "builds/d41c1c9ec2cf4002f3862575113d3385e77a6ac8d4475fe5e124704cb1ee7b7d.zip"
-       tags                   = {} -> null
!       tags_all               = {} -> (known after apply)
!       version_id             = "gY3zXc4wj71Y.HZgbdf85SMn7lG4dfmr" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.lambda_layer_s3.local_file.archive_plan[0] will be created
+   resource "local_file" "archive_plan" {
+       content              = jsonencode(
            {
+               artifacts_dir = "builds"
+               build_plan    = [
+                   [
+                       "zip",
+                       "dist",
+                       null,
                    ],
                ]
+               filename      = "builds/d41c1c9ec2cf4002f3862575113d3385e77a6ac8d4475fe5e124704cb1ee7b7d.zip"
+               runtime       = ""
            }
        )
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0755"
+       file_permission      = "0644"
+       filename             = "builds/d41c1c9ec2cf4002f3862575113d3385e77a6ac8d4475fe5e124704cb1ee7b7d.plan.json"
+       id                   = (known after apply)
    }

  # module.lambda_layer_s3.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
!       id       = "2183833168433511376" -> (known after apply)
!       triggers = {
!           "filename"  = "builds/e405213c84ee1b05f0526ef3186ac368accb3b50328be4d2dacaf7843780053f.zip" -> "builds/d41c1c9ec2cf4002f3862575113d3385e77a6ac8d4475fe5e124704cb1ee7b7d.zip"
!           "timestamp" = "1691589141678813000" -> "1691816172262412000"
        }
    }

  # module.lambda_layer_s3.null_resource.sam_metadata_aws_lambda_layer_version[0] must be replaced
-/+ resource "null_resource" "sam_metadata_aws_lambda_layer_version" {
!       id       = "7044411516538246393" -> (known after apply)
!       triggers = {
!           "built_output_path"    = "builds/e405213c84ee1b05f0526ef3186ac368accb3b50328be4d2dacaf7843780053f.zip" -> "builds/d41c1c9ec2cf4002f3862575113d3385e77a6ac8d4475fe5e124704cb1ee7b7d.zip"
            # (4 unchanged elements hidden)
        }
    }

Plan: 8 to add, 5 to change, 7 to destroy.
```
</details>